# Joins Intro :

basic joins :

1. Inner Join                                                               
2. Left Join                                                                  
3. Right Join
4. Left Outer Join = Left Join  (both are same)  **ask in interview**
5. Right Outer Join = Right Join  (both are same)  **ask in interview**
6. Outer Join
7. Cross - Cartesian Join **ask in interview**
   1.Computational high
   2.Efficiency low
   3.Time consuming
   4.Memory error

In [2]:
import pandas as pd

# Example for the joins

In [23]:
data_tb1 = {'a1' : [1,2,3,4], 'b1' : ['a','b','c','d']}
data_tb2 = {'a2' : [2,3], 'b2' : ['b','c']}

In [24]:
df1 = pd.DataFrame(data_tb1)
df2 = pd.DataFrame(data_tb2)

In [25]:
df1

   a1 b1
0   1  a
1   2  b
2   3  c
3   4  d

In [26]:
df2

   a2 b2
0   2  b
1   3  c

In [27]:
# inner join concept : ("common values")

# this inner join were compare the a1-column to the a2-column, 
# if it is match with the a1-column it will print otherwise it will ignore

pd.merge(df1,df2, left_on = 'a1', right_on = 'a2', how = 'inner')

# this is like selecting the prefered column to compare it (left_on = 'a1', right_on = 'a2')
# how = 'inner' this is the condition to perform the operation.

   a1 b1  a2 b2
0   2  b   2  b
1   3  c   3  c

In [28]:
# left join concept : ("left Dominant side")

# this left join were compare the a1-column to the a2-column,
# if it is match with the a1-column it will print 
# also it does't match with the column it will print with null value (NAN Value)
# ** it will print the all rows whether the column were match or not **

pd.merge(df1,df2, left_on = 'a1', right_on = 'a2', how = 'left')

   a1 b1   a2   b2
0   1  a  NaN  NaN
1   2  b  2.0    b
2   3  c  3.0    c
3   4  d  NaN  NaN

In [57]:
# Right join concept : ("right Dominant side")

# this right join were compare the u_id to user_id, 
# if it is match with the u_id it will print
# also it does't match with the column it will print with null value (NAN Value)
# ** it will print the all rows whether the column were match or not **

tb1 = {'user_id': ['u1','u2','u3','u4'], 'name' : ['n1','n2','n3','n4']}
tb2 = {'u_id' : ['u2','u3','u4','u10'], 'age' : [20,30,40,100]}

In [54]:
table1 = pd.DataFrame(tb1)
table2 = pd.DataFrame(tb2)

In [42]:
table1

  user_id name
0      u1   n1
1      u2   n2
2      u3   n3
3      u4   n4

In [43]:
table2

  u_id  age
0   u2   20
1   u3   30
2   u4   40
3  u10  100

In [44]:
# left join example :
pd.merge(table1,table2, left_on = 'user_id', right_on = 'u_id', how = 'left')

  user_id name u_id   age
0      u1   n1  NaN   NaN
1      u2   n2   u2  20.0
2      u3   n3   u3  30.0
3      u4   n4   u4  40.0

In [52]:
# right join example :
pd.merge(table1,table2, left_on = 'user_id', right_on = 'u_id', how = 'right')

  user_id name u_id  age
0      u2   n2   u2   20
1      u3   n3   u3   30
2      u4   n4   u4   40
3     NaN  NaN  u10  100

In [58]:
# home Work

In [83]:
t1 = {'user_id': ['u1','u2','u3','u4',''], 'name' : ['n1','n2','n3','n4','n5']}
t2 = {'u_id': ['u2','u3'], 'age' : [20,30]}

In [84]:
tab1 = pd.DataFrame(t1)
tab2 = pd.DataFrame(t2)

In [85]:
tab1

  user_id name
0      u1   n1
1      u2   n2
2      u3   n3
3      u4   n4
4           n5

In [86]:
tab2

  u_id  age
0   u2   20
1   u3   30

In [87]:
pd.merge(tab1, tab2, left_on = 'user_id', right_on = 'u_id', how = 'left')

  user_id name u_id   age
0      u1   n1  NaN   NaN
1      u2   n2   u2  20.0
2      u3   n3   u3  30.0
3      u4   n4  NaN   NaN
4           n5  NaN   NaN

In [21]:
# outer join concept :

# the combine of left join and right join
# first do the left join 
# second do the right join

t1 = {'user_id':[1,2,4,5],'name':['n1','n2','n4','n5']}
t2 = {'user_id':[1,3,4,6],'address':['n1','n3','n4','n6']}

In [22]:
table_1 = pd.DataFrame(t1)
table_2 = pd.DataFrame(t2)

In [23]:
table_1

   user_id name
0        1   n1
1        2   n2
2        4   n4
3        5   n5

In [24]:
table_2

   user_id address
0        1      n1
1        3      n3
2        4      n4
3        6      n6

In [25]:
pd.merge(table_1,table_2,left_on = 'user_id',right_on='user_id',how = 'outer')

   user_id name address
0        1   n1      n1
1        2   n2     NaN
2        3  NaN      n3
3        4   n4      n4
4        5   n5     NaN
5        6  NaN      n6

In [ ]:
# cross join - cartesian join
# it will join each row with each column

# Real Hands-on

In [60]:
customers = pd.read_csv(r"D:\Machine Learning\Joins\sources\customer_table_1.csv")
orders = pd.read_csv(r"D:\Machine Learning\Joins\sources\order_table.csv")

In [61]:
orders

,order_id,customer_id,order_date,amount,status,product_category,order_city,region
0,5001,CUST1019,2024-01-31,5375.38,Cancelled,Home,Pune,West
1,5002,CUST1027,2024-05-16,4866.07,Delivered,Grocery,Mumbai,West
2,5003,CUST1037,2024-03-12,239.85,Delivered,Electronics,Hyderabad,North
3,5004,CUST1034,2024-01-02,1024.72,Delivered,Home,Chennai,West
4,5005,CUST1020,2024-04-02,2095.72,Delivered,Clothing,Mumbai,South
...,...,...,...,...,...,...,...,...
195,5196,CUST1041,2024-06-11,5569.65,Cancelled,Books,Hyderabad,East
196,5197,CUST1019,2024-03-09,1106.90,Returned,Home,Delhi,West
197,5198,CUST1032,2024-06-15,4264.23,Returned,Books,Chennai,North
198,5199,CUST1029,2024-06-15,5835.88,Returned,Electronics,Delhi,East
199,5200,CUST1038,2024-01-10,5406.42,Cancelled,Books,Chennai,North

In [62]:
customers

     cust_id     name       city signup_date    vip region  age
0   CUST1000   Vivaan      Delhi  2022-01-12  False   West   56
1   CUST1001    Divya  Hyderabad  2022-01-02   True   East   39
2   CUST1002    Rohit     Mumbai  2023-07-29   True   East   19
3   CUST1003    Kavya    Chennai  2022-05-26   True   East   54
4   CUST1004      Sai      Delhi  2023-03-05  False  South   39
5   CUST1005    Rohit    Chennai  2023-10-18  False   West   37
6   CUST1006    Kavya      Delhi  2022-07-03   True   East   35
7   CUST1007    Rohit     Mumbai  2022-03-03  False   East   26
8   CUST1008    Pooja     Mumbai  2023-02-01   True   East   27
9   CUST1009      Sai     Mumbai  2022-06-13  False  North   23
10  CUST1010    Meera    Chennai  2023-11-12   True  North   32
11  CUST1011    Pooja      Delhi  2022-05-15   True  South   18
12  CUST1012    Rohit       Pune  2023-01-20  False  South   30
13  CUST1013    Meera      Delhi  2023-06-17  False  South   40
14  CUST1014    Rohit      Delhi  2023-02-14   True  South   43
15  CUST1015    Rahul  Bangalore  2022-02-23  False   West   60
16  CUST1016   Vivaan  Bangalore  2023-02-16  False   West   25
17  CUST1017    Sneha  Bangalore  2022-07-18  False   East   57
18  CUST1018    Kavya  Bangalore  2024-03-09  False   East   32
19  CUST1019    Sneha     Mumbai  2022-02-13  False  North   37
20  CUST1020    Rahul  Bangalore  2023-10-14   True   East   34
21  CUST1021    Rahul    Chennai  2022-01-21   True  South   43
22  CUST1022    Divya       Pune  2022-11-19   True  South   44
23  CUST1023   Ananya    Chennai  2024-05-04  False  North   28
24  CUST1024   Ananya     Mumbai  2023-01-23  False  South   42
25  CUST1025    Arjun       Pune  2022-01-20   True  South   34
26  CUST1026    Arjun      Delhi  2024-06-12  False  South   54
27  CUST1027  Karthik    Chennai  2022-01-15   True   East   31
28  CUST1028    Pooja  Hyderabad  2022-01-12   True  South   19
29  CUST1029    Priya  Hyderabad  2024-03-04  False   West   19
30  CUST1030   Ananya       Pune  2022-04-01  False  North   46
31  CUST1031   Aditya       Pune  2022-08-29  False  South   37
32  CUST1032    Sneha       Pune  2022-05-05   True  South   20
33  CUST1033   Ananya       Pune  2022-10-20  False   West   38
34  CUST1034    Priya      Delhi  2023-06-08  False  South   53
35  CUST1035    Sneha  Bangalore  2022-02-01   True  North   40
36  CUST1036    Rahul      Delhi  2023-08-30   True  South   32
37  CUST1037    Aarav    Chennai  2023-10-18   True  North   56
38  CUST1038    Meera     Mumbai  2023-04-26   True   East   58
39  CUST1039  Karthik    Chennai  2022-12-14  False   East   52
40  CUST1040    Priya    Chennai  2022-09-24  False  North   54
41  CUST1041   Vivaan  Bangalore  2024-06-04  False   East   26
42  CUST1042      Sai  Bangalore  2022-10-10   True   West   23
43  CUST1043    Kavya     Mumbai  2024-05-13  False   East   44
44  CUST1044    Priya       Pune  2023-05-06  False  South   56
45  CUST1045   Ananya    Chennai  2023-12-22  False   East   53
46  CUST1046    Aarav      Delhi  2022-04-18  False   East   33
47  CUST1047    Meera       Pune  2023-10-31  False   West   59
48  CUST1048    Aarav       Pune  2024-01-08   True   West   30
49  CUST1049    Divya    Chennai  2022-06-13  False  South   18

In [7]:
# Problem Statement - 1

# the question is want to track all the customers orders data's without missing a single data 
# collect all the information

pd.merge(orders, customers, left_on = 'customer_id', right_on = 'cust_id', how = 'left').tail()

,order_id,customer_id,order_date,amount,status,product_category,order_city,region_x,cust_id,name,city,signup_date,vip,region_y,age
195,5196,CUST1041,2024-06-11,5569.65,Cancelled,Books,Hyderabad,East,CUST1041,Vivaan,Bangalore,2024-06-04,False,East,26
196,5197,CUST1019,2024-03-09,1106.90,Returned,Home,Delhi,West,CUST1019,Sneha,Mumbai,2022-02-13,False,North,37
197,5198,CUST1032,2024-06-15,4264.23,Returned,Books,Chennai,North,CUST1032,Sneha,Pune,2022-05-05,True,South,20
198,5199,CUST1029,2024-06-15,5835.88,Returned,Electronics,Delhi,East,CUST1029,Priya,Hyderabad,2024-03-04,False,West,19
199,5200,CUST1038,2024-01-10,5406.42,Cancelled,Books,Chennai,North,CUST1038,Meera,Mumbai,2023-04-26,True,East,58

In [8]:
# Problem Statement  - 2

# do we have any customer who has purchased something on the same day as their signup date

In [5]:
orders.head()

,order_id,customer_id,order_date,amount,status,product_category,order_city,region
0,5001,CUST1019,2024-01-31,5375.38,Cancelled,Home,Pune,West
1,5002,CUST1027,2024-05-16,4866.07,Delivered,Grocery,Mumbai,West
2,5003,CUST1037,2024-03-12,239.85,Delivered,Electronics,Hyderabad,North
3,5004,CUST1034,2024-01-02,1024.72,Delivered,Home,Chennai,West
4,5005,CUST1020,2024-04-02,2095.72,Delivered,Clothing,Mumbai,South

In [6]:
customers.head()

    cust_id    name       city signup_date    vip region  age
0  CUST1000  Vivaan      Delhi  2022-01-12  False   West   56
1  CUST1001   Divya  Hyderabad  2022-01-02   True   East   39
2  CUST1002   Rohit     Mumbai  2023-07-29   True   East   19
3  CUST1003   Kavya    Chennai  2022-05-26   True   East   54
4  CUST1004     Sai      Delhi  2023-03-05  False  South   39

In [7]:
# inner join

In [8]:
pd.merge(orders,customers,
         left_on = ["customer_id","order_date"],
         right_on = ["cust_id","signup_date"],
         how = "inner"
)

Empty DataFrame
Columns: [order_id, customer_id, order_date, amount, status, product_category, order_city, region_x, cust_id, name, city, signup_date, vip, region_y, age]
Index: []

In [9]:
# Problem Statement - 3

# who are all the VIP customers, to collect the total numbers of order
# who are all the non-vip customers, to collect the total numbers of order

In [10]:
orders.head()

,order_id,customer_id,order_date,amount,status,product_category,order_city,region
0,5001,CUST1019,2024-01-31,5375.38,Cancelled,Home,Pune,West
1,5002,CUST1027,2024-05-16,4866.07,Delivered,Grocery,Mumbai,West
2,5003,CUST1037,2024-03-12,239.85,Delivered,Electronics,Hyderabad,North
3,5004,CUST1034,2024-01-02,1024.72,Delivered,Home,Chennai,West
4,5005,CUST1020,2024-04-02,2095.72,Delivered,Clothing,Mumbai,South

In [11]:
customers.head()

    cust_id    name       city signup_date    vip region  age
0  CUST1000  Vivaan      Delhi  2022-01-12  False   West   56
1  CUST1001   Divya  Hyderabad  2022-01-02   True   East   39
2  CUST1002   Rohit     Mumbai  2023-07-29   True   East   19
3  CUST1003   Kavya    Chennai  2022-05-26   True   East   54
4  CUST1004     Sai      Delhi  2023-03-05  False  South   39

In [54]:
o_list = orders[['customer_id','order_id']]

In [55]:
# we take the needed columns for filtering

o_list

    customer_id  order_id
0      CUST1019      5001
1      CUST1027      5002
2      CUST1037      5003
3      CUST1034      5004
4      CUST1020      5005
..          ...       ...
195    CUST1041      5196
196    CUST1019      5197
197    CUST1032      5198
198    CUST1029      5199
199    CUST1038      5200

[200 rows x 2 columns]

In [76]:
# this is for VIP-customers purchase data

v = customers[customers['vip'] == True]

In [99]:
# those are the vip members
v

     cust_id     name       city signup_date   vip region  age
1   CUST1001    Divya  Hyderabad  2022-01-02  True   East   39
2   CUST1002    Rohit     Mumbai  2023-07-29  True   East   19
3   CUST1003    Kavya    Chennai  2022-05-26  True   East   54
6   CUST1006    Kavya      Delhi  2022-07-03  True   East   35
8   CUST1008    Pooja     Mumbai  2023-02-01  True   East   27
10  CUST1010    Meera    Chennai  2023-11-12  True  North   32
11  CUST1011    Pooja      Delhi  2022-05-15  True  South   18
14  CUST1014    Rohit      Delhi  2023-02-14  True  South   43
20  CUST1020    Rahul  Bangalore  2023-10-14  True   East   34
21  CUST1021    Rahul    Chennai  2022-01-21  True  South   43
22  CUST1022    Divya       Pune  2022-11-19  True  South   44
25  CUST1025    Arjun       Pune  2022-01-20  True  South   34
27  CUST1027  Karthik    Chennai  2022-01-15  True   East   31
28  CUST1028    Pooja  Hyderabad  2022-01-12  True  South   19
32  CUST1032    Sneha       Pune  2022-05-05  True  South   20
35  CUST1035    Sneha  Bangalore  2022-02-01  True  North   40
36  CUST1036    Rahul      Delhi  2023-08-30  True  South   32
37  CUST1037    Aarav    Chennai  2023-10-18  True  North   56
38  CUST1038    Meera     Mumbai  2023-04-26  True   East   58
42  CUST1042      Sai  Bangalore  2022-10-10  True   West   23
48  CUST1048    Aarav       Pune  2024-01-08  True   West   30

In [95]:
m = pd.merge(o_list,v, 
         left_on = "customer_id",
         right_on = "cust_id",
         how ='inner'
)

In [96]:
m

,customer_id,order_id,cust_id,name,city,signup_date,vip,region,age
0,CUST1027,5002,CUST1027,Karthik,Chennai,2022-01-15,True,East,31
1,CUST1037,5003,CUST1037,Aarav,Chennai,2023-10-18,True,North,56
2,CUST1020,5005,CUST1020,Rahul,Bangalore,2023-10-14,True,East,34
3,CUST1003,5006,CUST1003,Kavya,Chennai,2022-05-26,True,East,54
4,CUST1036,5007,CUST1036,Rahul,Delhi,2023-08-30,True,South,32
...,...,...,...,...,...,...,...,...,...
72,CUST1036,5190,CUST1036,Rahul,Delhi,2023-08-30,True,South,32
73,CUST1002,5191,CUST1002,Rohit,Mumbai,2023-07-29,True,East,19
74,CUST1006,5193,CUST1006,Kavya,Delhi,2022-07-03,True,East,35
75,CUST1032,5198,CUST1032,Sneha,Pune,2022-05-05,True,South,20
76,CUST1038,5200,CUST1038,Meera,Mumbai,2023-04-26,True,East,58

In [101]:
vip_purchase = m.groupby(['customer_id']).agg(
    {'order_id' : 'count'}
).reset_index()

In [102]:
# the vip purchase list
vip_purchase

   customer_id  order_id
0     CUST1001         8
1     CUST1002         5
2     CUST1003         6
3     CUST1006         3
4     CUST1008         5
5     CUST1010         3
6     CUST1011         4
7     CUST1014         6
8     CUST1020         1
9     CUST1021         2
10    CUST1022         2
11    CUST1025         4
12    CUST1027         3
13    CUST1028         2
14    CUST1032         4
15    CUST1035         3
16    CUST1036         4
17    CUST1037         2
18    CUST1038         4
19    CUST1042         4
20    CUST1048         2

In [105]:
# this is for Non-VIP customers purchase data

n = customers[customers['vip'] == False]

In [107]:
z = pd.merge(o_list,n, 
         left_on = "customer_id",
         right_on = "cust_id",
         how ='inner'
)

In [121]:
nvip_purchase = z.groupby(['customer_id']).agg(
    {'order_id':'count'}
).reset_index()

In [123]:
# the non-vip purchase list
nvip_purchase

   customer_id  order_id
0     CUST1000         2
1     CUST1004         7
2     CUST1005         2
3     CUST1009         8
4     CUST1012         2
5     CUST1013         3
6     CUST1015         3
7     CUST1016         5
8     CUST1017         2
9     CUST1018         5
10    CUST1019         9
11    CUST1023         3
12    CUST1024         2
13    CUST1026         3
14    CUST1029         7
15    CUST1030         5
16    CUST1031         5
17    CUST1033         4
18    CUST1034         3
19    CUST1039         7
20    CUST1040         3
21    CUST1041         5
22    CUST1043         9
23    CUST1044         3
24    CUST1045         7
25    CUST1046         2
26    CUST1047         5
27    CUST1049         2

In [1]:
# Problem Statement - 4

In [2]:
# a quantity of purchased by age of 20 to 40

In [6]:
customers.head()

    cust_id    name       city signup_date    vip region  age
0  CUST1000  Vivaan      Delhi  2022-01-12  False   West   56
1  CUST1001   Divya  Hyderabad  2022-01-02   True   East   39
2  CUST1002   Rohit     Mumbai  2023-07-29   True   East   19
3  CUST1003   Kavya    Chennai  2022-05-26   True   East   54
4  CUST1004     Sai      Delhi  2023-03-05  False  South   39

In [7]:
orders.head()

,order_id,customer_id,order_date,amount,status,product_category,order_city,region
0,5001,CUST1019,2024-01-31,5375.38,Cancelled,Home,Pune,West
1,5002,CUST1027,2024-05-16,4866.07,Delivered,Grocery,Mumbai,West
2,5003,CUST1037,2024-03-12,239.85,Delivered,Electronics,Hyderabad,North
3,5004,CUST1034,2024-01-02,1024.72,Delivered,Home,Chennai,West
4,5005,CUST1020,2024-04-02,2095.72,Delivered,Clothing,Mumbai,South

In [55]:
# this is the age filteration between 20 to 40 age category

age_cat = customers[(customers["age"] >= 20) & (customers["age"] <= 40)]

In [56]:
age_cat

     cust_id     name       city signup_date    vip region  age
1   CUST1001    Divya  Hyderabad  2022-01-02   True   East   39
4   CUST1004      Sai      Delhi  2023-03-05  False  South   39
5   CUST1005    Rohit    Chennai  2023-10-18  False   West   37
6   CUST1006    Kavya      Delhi  2022-07-03   True   East   35
7   CUST1007    Rohit     Mumbai  2022-03-03  False   East   26
8   CUST1008    Pooja     Mumbai  2023-02-01   True   East   27
9   CUST1009      Sai     Mumbai  2022-06-13  False  North   23
10  CUST1010    Meera    Chennai  2023-11-12   True  North   32
12  CUST1012    Rohit       Pune  2023-01-20  False  South   30
13  CUST1013    Meera      Delhi  2023-06-17  False  South   40
16  CUST1016   Vivaan  Bangalore  2023-02-16  False   West   25
18  CUST1018    Kavya  Bangalore  2024-03-09  False   East   32
19  CUST1019    Sneha     Mumbai  2022-02-13  False  North   37
20  CUST1020    Rahul  Bangalore  2023-10-14   True   East   34
23  CUST1023   Ananya    Chennai  2024-05-04  False  North   28
25  CUST1025    Arjun       Pune  2022-01-20   True  South   34
27  CUST1027  Karthik    Chennai  2022-01-15   True   East   31
31  CUST1031   Aditya       Pune  2022-08-29  False  South   37
32  CUST1032    Sneha       Pune  2022-05-05   True  South   20
33  CUST1033   Ananya       Pune  2022-10-20  False   West   38
35  CUST1035    Sneha  Bangalore  2022-02-01   True  North   40
36  CUST1036    Rahul      Delhi  2023-08-30   True  South   32
41  CUST1041   Vivaan  Bangalore  2024-06-04  False   East   26
42  CUST1042      Sai  Bangalore  2022-10-10   True   West   23
46  CUST1046    Aarav      Delhi  2022-04-18  False   East   33
48  CUST1048    Aarav       Pune  2024-01-08   True   West   30

In [67]:
# now to match the customers from customers tables

ages_list = pd.merge(age_cat,orders,left_on = "cust_id",right_on = "customer_id",how = "inner")

In [68]:
ages_list

,cust_id,name,city,signup_date,vip,region_x,age,order_id,customer_id,order_date,amount,status,product_category,order_city,region_y
0,CUST1001,Divya,Hyderabad,2022-01-02,True,East,39,5037,CUST1001,2024-02-23,3489.60,Returned,Books,Bangalore,North
1,CUST1001,Divya,Hyderabad,2022-01-02,True,East,39,5041,CUST1001,2024-03-03,4714.40,Returned,Grocery,Delhi,South
2,CUST1001,Divya,Hyderabad,2022-01-02,True,East,39,5056,CUST1001,2024-01-09,2086.23,Pending,Home,Chennai,South
3,CUST1001,Divya,Hyderabad,2022-01-02,True,East,39,5057,CUST1001,2024-03-30,2915.18,Delivered,Home,Delhi,East
4,CUST1001,Divya,Hyderabad,2022-01-02,True,East,39,5062,CUST1001,2024-04-10,4401.92,Delivered,Electronics,Chennai,East
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
99,CUST1042,Sai,Bangalore,2022-10-10,True,West,23,5173,CUST1042,2024-06-23,607.98,Delivered,Home,Chennai,East
100,CUST1046,Aarav,Delhi,2022-04-18,False,East,33,5023,CUST1046,2024-04-02,1393.84,Returned,Clothing,Delhi,East
101,CUST1046,Aarav,Delhi,2022-04-18,False,East,33,5168,CUST1046,2024-05-13,1426.80,Returned,Home,Hyderabad,South
102,CUST1048,Aarav,Pune,2024-01-08,True,West,30,5033,CUST1048,2024-01-13,1059.98,Pending,Home,Chennai,East
103,CUST1048,Aarav,Pune,2024-01-08,True,West,30,5150,CUST1048,2024-02-01,328.35,Returned,Grocery,Chennai,South

In [69]:
ages_list.groupby(['customer_id']).agg(
    {'order_id' : 'count'}
).reset_index()

   customer_id  order_id
0     CUST1001         8
1     CUST1004         7
2     CUST1005         2
3     CUST1006         3
4     CUST1008         5
5     CUST1009         8
6     CUST1010         3
7     CUST1012         2
8     CUST1013         3
9     CUST1016         5
10    CUST1018         5
11    CUST1019         9
12    CUST1020         1
13    CUST1023         3
14    CUST1025         4
15    CUST1027         3
16    CUST1031         5
17    CUST1032         4
18    CUST1033         4
19    CUST1035         3
20    CUST1036         4
21    CUST1041         5
22    CUST1042         4
23    CUST1046         2
24    CUST1048         2

In [70]:
pd.merge(age_cat,orders,left_on = "cust_id",right_on = "customer_id",how = "inner")['order_id'].count()

np.int64(104)

# Some Big Problems

In [57]:
customers = pd.read_csv(r"D:\Machine Learning\Joins\sources\customer_table_2.csv")
transactions = pd.read_csv(r"D:\Machine Learning\Joins\sources\transaction_table.csv")

In [58]:
customers.head()

   customer_id                name country region segment signup_date
0            1      Hrishita Samra   India  North     SME  2023-07-18
1            2          Vidur Saha   India  South  Retail  2022-07-29
2            3           Rati Gala   India  North     SME  2024-05-14
3            4  Nehmat Subramanian   India  North  Retail  2023-03-24
4            5          Kaira Mane   India  North     SME  2023-02-12

In [59]:
transactions.head()

,transaction_id,customer_id,product,quantity,amount,payment_method,date,category
0,1,62,Tablet,1,21085,UPI,2024-07-19,Electronics
1,2,105,Laptop,2,1700,Card,2024-12-06,Electronics
2,3,9,Keyboard,4,154700,UPI,2023-10-23,Accessories
3,4,19,Mouse,3,180030,NetBanking,2023-08-28,Accessories
4,5,109,Tablet,5,132140,UPI,2024-07-11,Electronics

In [6]:
# Problem Statement - 1

# to get the customers respective region for a respective segment  - calculate the amount summary (sum, avg, mean)

cust = customers[['customer_id','name','region','segment']]

In [7]:
# take the need data first for both tables
cust

     customer_id                name region    segment
0              1      Hrishita Samra  North        SME
1              2          Vidur Saha  South     Retail
2              3           Rati Gala  North        SME
3              4  Nehmat Subramanian  North     Retail
4              5          Kaira Mane  North        SME
..           ...                 ...    ...        ...
195          196        Azad Acharya   East     Retail
196          197      Hrishita Samra   West        SME
197          198       Indrajit Yogi   West  Corporate
198          199           Arnav Deo   West  Corporate
199          200         Romil Sathe  North     Retail

[200 rows x 4 columns]

In [8]:
trans = transactions[['customer_id','amount']]

In [9]:
trans.head()

   customer_id  amount
0           62   21085
1          105    1700
2            9  154700
3           19  180030
4          109  132140

In [10]:
# now to join the two table with customer_id key

amt_info = pd.merge(trans,cust,left_on='customer_id',right_on = 'customer_id',how = 'left')

In [11]:
amt_info.head()

   customer_id  amount              name region segment
0           62   21085      Azad Thakkar  North  Retail
1          105    1700     Jayant Shenoy   East  Retail
2            9  154700     Aarush Doctor   East  Retail
3           19  180030  Miraya Jayaraman  South     SME
4          109  132140    Hrishita Samra   West     SME

In [12]:
# now groupby the cus_id with region, segment and also with calulate the summary 

amt_info.groupby(['customer_id','name','region','segment'])[['customer_id','name','region','segment','amount']].agg(
    {'amount' : 'sum'}
).reset_index()

     customer_id              name region    segment  amount
0              1    Hrishita Samra  North        SME  449386
1              2        Vidur Saha  South     Retail   48678
2              3         Rati Gala  North        SME  145904
3              6         Rati Gala   West     Retail   53588
4              7      Shalv Gulati   East     Retail  130686
..           ...               ...    ...        ...     ...
123          194    Hrishita Samra  North  Corporate  245244
124          195  Miraya Jayaraman  North     Retail  349592
125          196      Azad Acharya   East     Retail   16095
126          197    Hrishita Samra   West        SME   84558
127          200       Romil Sathe  North     Retail  361942

[128 rows x 5 columns]

In [13]:
# this is the actual solution

amt_info.groupby(['customer_id','name','region','segment'])[['customer_id','name','region','segment','amount']].agg(
    total_revenue=('amount','sum'),
    avg_revenue=('amount','mean')
).reset_index()

,customer_id,name,region,segment,total_revenue,avg_revenue
0,1,Hrishita Samra,North,SME,449386,224693.000000
1,2,Vidur Saha,South,Retail,48678,48678.000000
2,3,Rati Gala,North,SME,145904,145904.000000
3,6,Rati Gala,West,Retail,53588,53588.000000
4,7,Shalv Gulati,East,Retail,130686,65343.000000
...,...,...,...,...,...,...
123,194,Hrishita Samra,North,Corporate,245244,245244.000000
124,195,Miraya Jayaraman,North,Retail,349592,116530.666667
125,196,Azad Acharya,East,Retail,16095,16095.000000
126,197,Hrishita Samra,West,SME,84558,84558.000000
127,200,Romil Sathe,North,Retail,361942,120647.333333

In [14]:
# this one is segmenting the region itself for to see the each region segment

amt_info.groupby(['region','segment'])[['customer_id','name','region','segment','amount']].agg(
    total_revenue=('amount','sum'),
    avg_revenue=('amount','mean')
).reset_index()

   region    segment  total_revenue    avg_revenue
0    East  Corporate        1385326   98951.857143
1    East     Retail        1328272   94876.571429
2    East        SME         837535   64425.769231
3   North  Corporate        2206834  105087.333333
4   North     Retail        1889127  111125.117647
5   North        SME        2924511  139262.428571
6   South  Corporate        1815540  129681.428571
7   South     Retail        1528901   72804.809524
8   South        SME        2879780   99302.758621
9    West  Corporate        1263826  114893.272727
10   West     Retail         685944   62358.545455
11   West        SME        1247559   89111.357143

In [15]:
transactions['payment_method'].unique()

array(['UPI', 'Card', 'NetBanking'], dtype=object)

In [16]:
# Problem Statement - 2

# max revenue of customers in last 6 months via UPI/card

In [17]:
# here changed the date(str) into date time data_type
transactions['date'] = pd.to_datetime(transactions['date'])

In [21]:
# now want to calculate the 6 months period of RECORDS

cutoff = transactions['date'].max() - pd.Timedelta(days = 180)

In [22]:
cutoff

Timestamp('2024-08-02 00:00:00')

In [29]:
trans_filter = transactions[(transactions['date'] >= cutoff) & (transactions['payment_method'].isin(['UPI','Card']))
                    # Longer Method
                            # (
                            #     (transactions['payment_method'] == 'UPI') |
                            #     (transactions['payment_method'] == 'Card')
                            # )
    ]

In [30]:
trans_filter

,transaction_id,customer_id,product,quantity,amount,payment_method,date,category
1,2,105,Laptop,2,1700,Card,2024-12-06,Electronics
12,13,150,Headphones,3,72864,Card,2024-10-12,Accessories
20,21,74,Tablet,5,88360,Card,2024-12-16,Electronics
26,27,99,Headphones,5,97290,UPI,2024-09-05,Accessories
28,29,1,Monitor,5,177590,Card,2025-01-13,Electronics
31,32,179,Headphones,3,75681,UPI,2024-08-08,Accessories
44,45,45,Keyboard,2,45560,UPI,2024-09-16,Accessories
46,47,118,Mobile,4,135156,Card,2024-11-13,Electronics
48,49,151,Laptop,4,183172,Card,2024-10-16,Electronics
50,51,61,Monitor,4,57916,Card,2024-08-08,Electronics
53,54,74,Monitor,1,65607,UPI,2024-09-13,Electronics
54,55,163,Monitor,3,87615,UPI,2024-09-27,Electronics
56,57,149,Tablet,4,19492,Card,2025-01-19,Electronics
63,64,150,Headphones,3,104586,Card,2024-10-15,Accessories
64,65,121,Tablet,1,31147,UPI,2024-09-26,Electronics
65,66,166,Keyboard,3,88545,UPI,2024-10-12,Accessories
74,75,170,Laptop,4,50060,UPI,2024-10-19,Electronics
77,78,85,Keyboard,2,62078,UPI,2024-09-02,Accessories
84,85,78,Keyboard,1,68847,Card,2024-10-20,Accessories
85,86,103,Laptop,1,63281,Card,2024-12-03,Electronics
87,88,33,Keyboard,2,18218,Card,2024-10-01,Accessories
91,92,103,Headphones,3,179823,Card,2025-01-17,Accessories
98,99,55,Laptop,5,335035,UPI,2024-11-03,Electronics
103,104,47,Tablet,3,3900,UPI,2024-08-02,Electronics
116,117,19,Keyboard,5,234605,Card,2025-01-29,Accessories
132,133,166,Monitor,3,31671,UPI,2024-09-21,Electronics
139,140,105,Tablet,3,153837,Card,2024-11-26,Electronics
150,151,170,Monitor,5,27235,Card,2024-09-24,Electronics
171,172,110,Mobile,2,77354,UPI,2024-09-21,Electronics
179,180,35,Mouse,4,97564,UPI,2025-01-03,Accessories
182,183,65,Headphones,5,312745,UPI,2024-10-24,Accessories
183,184,200,Mobile,3,141867,UPI,2024-11-02,Electronics
195,196,155,Tablet,4,18976,UPI,2024-11-26,Electronics
196,197,114,Headphones,3,147780,UPI,2024-08-10,Accessories
197,198,102,Mobile,5,242980,Card,2024-10-27,Electronics

In [36]:
cust_sum = trans_filter.groupby(['customer_id']).agg(
    total_revenue = ('amount','sum'),
    last_purchase = ('date','max')
).reset_index()

In [37]:
cust_sum

    customer_id  total_revenue last_purchase
0             1         177590    2025-01-13
1            19         234605    2025-01-29
2            33          18218    2024-10-01
3            35          97564    2025-01-03
4            45          45560    2024-09-16
5            47           3900    2024-08-02
6            55         335035    2024-11-03
7            61          57916    2024-08-08
8            65         312745    2024-10-24
9            74         153967    2024-12-16
10           78          68847    2024-10-20
11           85          62078    2024-09-02
12           99          97290    2024-09-05
13          102         242980    2024-10-27
14          103         243104    2025-01-17
15          105         155537    2024-12-06
16          110          77354    2024-09-21
17          114         147780    2024-08-10
18          118         135156    2024-11-13
19          121          31147    2024-09-26
20          149          19492    2025-01-19
21          150         177450    2024-10-15
22          151         183172    2024-10-16
23          155          18976    2024-11-26
24          163          87615    2024-09-27
25          166         120216    2024-10-12
26          170          77295    2024-10-19
27          179          75681    2024-08-08
28          200         141867    2024-11-02

In [44]:
cust_sum['rank'] = cust_sum['total_revenue'].rank(method = 'dense', ascending = False)

In [50]:
cust_sum[cust_sum['rank']<=5]

    customer_id  total_revenue last_purchase  rank
1            19         234605    2025-01-29   5.0
6            55         335035    2024-11-03   1.0
8            65         312745    2024-10-24   2.0
13          102         242980    2024-10-27   4.0
14          103         243104    2025-01-17   3.0